# Напишите код, который переводит целое число в строку,
#  при том что его можно применить в любой системе счисления.

#Второй аргумент функции int отвечает за указание основания системы счисления:

print(int('ABC', 16))